beatfan/MPC5744P_Bootloader_DownMachine/MPC5744P_CAN_UserApp/src/Drivers/System/MPC5744P_features.h
/* @brief FLEXCAN0 configurable interface clock. */
#define FEATURE_FLEXCAN0_CLK_CONFIGURABLE_INTERFACE_CLOCK (0U)

/* @brief PBRIDGEx system clock divider index. */
#define FEATURE_PBRIDGEx_CLK_SYSTEM_CLOCK_DIVIDER_INDEX (0U)

/* @brief PLL0_PHI1 reference entry value. */
#define FEATURE_PLL0_PHI1_REFERENCE_ENTRY_VALUE (3U)


#define FEATURE_HAS_SIRC_CLK             (0U)
#define FEATURE_HAS_FIRC_CLK             (0U)
#define FEATURE_HAS_IRCOSC_CLK           (1U)
#define FEATURE_HAS_SXOSC_CLK            (0U)
#define FEATURE_HAS_FXOSC_CLK            (0U)
#define FEATURE_HAS_XOSC_CLK             (1U)
#define FEATURE_HAS_PLL_PHI0_CLK         (0U)
#define FEATURE_HAS_PLL_PHI1_CLK         (0U)
#define FEATURE_HAS_PLL0_PHI0_CLK        (1U)
#define FEATURE_HAS_PLL0_PHI1_CLK        (1U)
#define FEATURE_HAS_PLL1_PHI0_CLK        (1U)
#define FEATURE_HAS_PLL1_PHI1_CLK        (0U)
#define FEATURE_HAS_SDPLL_CLK            (0U)
#define FEATURE_HAS_SCS_CLK              (1U)
#define FEATURE_HAS_SCS_CLKS             (0U)
#define FEATURE_HAS_S160_CLK             (0U)
#define FEATURE_HAS_S160_CLKS            (0U)
#define FEATURE_HAS_S80_CLK              (0U)
#define FEATURE_HAS_S80_CLKS             (0U)
#define FEATURE_HAS_S40_CLK              (0U)
#define FEATURE_HAS_S40_CLKS             (0U)
#define FEATURE_HAS_F40_CLK              (0U)
#define FEATURE_HAS_F40_CLKS             (0U)
#define FEATURE_HAS_F80_CLK              (0U)
#define FEATURE_HAS_F80_CLKS             (0U)
#define FEATURE_HAS_FS80_CLK             (0U)
#define FEATURE_HAS_FS80_CLKS            (0U)
#define FEATURE_HAS_F20_CLK              (0U)
#define FEATURE_HAS_F20_CLKS             (0U)
#define FEATURE_HAS_DMA_CLK              (0U)
#define FEATURE_HAS_DMA_CLKS             (0U)
#define FEATURE_HAS_PBRIDGEx_CLK         (1U)
#define FEATURE_HAS_PBRIDGEx_CLKS        (1U)
#define FEATURE_HAS_HALFSYS_CLK          (1U)
#define FEATURE_HAS_HALFSYS_CLKS         (1U)
#define FEATURE_HAS_SYS_CLK              (0U)
#define FEATURE_HAS_SYS_CLKS             (0U)
#define FEATURE_HAS_MOTC_CLK             (1U)
#define FEATURE_HAS_MOTC_CLKS            (1U)
#define FEATURE_HAS_PER_CLK              (0U)
#define FEATURE_HAS_PER_CLKS             (0U)
#define FEATURE_HAS_SXBAR_CLK            (0U)
#define FEATURE_HAS_SXBAR_CLKS           (0U)
#define FEATURE_HAS_ADC_CLKS             (1U)
#define FEATURE_HAS_ADCSD_CLKS           (0U)
#define FEATURE_HAS_DSPI_CLKS            (0U)
#define FEATURE_HAS_DSPIM_CLKS           (0U)
#define FEATURE_HAS_ENET_CLKS            (1U)
#define FEATURE_HAS_ENET_TIME_CLKS       (1U)
#define FEATURE_HAS_EMIOS_CLKS           (0U)
#define FEATURE_HAS_ETPU_CLKS            (0U)
#define FEATURE_HAS_FLEXCAN_CLKS         (1U)
#define FEATURE_HAS_FLEXRAY_CLKS         (1U)
#define FEATURE_HAS_LFAST_CLKS           (1U)
#define FEATURE_HAS_LIN_CLKS             (0U)
#define FEATURE_HAS_RTI_CLKS             (0U)
#define FEATURE_HAS_SDHC_CLKS            (0U)
#define FEATURE_HAS_SENT_CLKS            (1U)
#define FEATURE_HAS_SGEN_CLKS            (1U)
#define FEATURE_HAS_SPI_CLKS             (0U)
#define FEATURE_HAS_SPT_CLKS             (0U)
#define FEATURE_HAS_CORE0_CLK            (0U)
#define FEATURE_HAS_CORE1_CLK            (0U)
#define FEATURE_HAS_CORE2_CLK            (0U)



#define FEATURE_PROTOCOL_CLOCK_FOR_ADC                 AC0__SC
#define FEATURE_PROTOCOL_CLOCK_FOR_ADCSD               NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_DSPI                NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_DSPIM               NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_ENET                AC10__SC
#define FEATURE_PROTOCOL_CLOCK_FOR_ENET_TIME           AC11__SC
#define FEATURE_PROTOCOL_CLOCK_FOR_EMIOS               NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_ETPU                NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_FLEXCAN             NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_FLEXRAY             NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_LFAST               AC5__SC
#define FEATURE_PROTOCOL_CLOCK_FOR_LIN                 NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_RTI                 NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_SDHC                NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_SENT                AC1__SC
#define FEATURE_PROTOCOL_CLOCK_FOR_SGEN                AC0__SC
#define FEATURE_PROTOCOL_CLOCK_FOR_SPI                 NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_SPT                 NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_ADC                NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_ADCSD              NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_DSPI               NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_DSPIM              NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_ENET               NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_ENET_TIME          NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_EMIOS              NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_ETPU               NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_FLEXCAN            NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_FLEXRAY            NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_LFAST              NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_LIN                NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_RTI                NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_SDHC               NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_SENT               NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_SGEN               NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_SPI                NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_SPT                NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_ADC             AC0__DC2
#define FEATURE_FRACTIONAL_DIVIDER_FOR_ADCSD           NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_DSPI            NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_DSPIM           NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_ENET            AC10__DC0
#define FEATURE_FRACTIONAL_DIVIDER_FOR_ENET_TIME       AC11__DC0
#define FEATURE_FRACTIONAL_DIVIDER_FOR_EMIOS           NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_ETPU            NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_FLEXCAN         AC2__DC0
#define FEATURE_FRACTIONAL_DIVIDER_FOR_FLEXRAY         AC1__DC0
#define FEATURE_FRACTIONAL_DIVIDER_FOR_LFAST           AC5__DC0
#define FEATURE_FRACTIONAL_DIVIDER_FOR_LIN             NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_RTI             NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_SDHC            NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_SENT            AC1__DC1
#define FEATURE_FRACTIONAL_DIVIDER_FOR_SGEN            AC0__DC1
#define FEATURE_FRACTIONAL_DIVIDER_FOR_SPI             NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_SPT             NO_AC


/*! @brief Clock names. */
typedef enum {
    /* Clock sources */
    IRCOSC_CLK                     = 0u,      /*!< IRCOSC_CLK clock source                */
    XOSC_CLK                       = 1u,      /*!< XOSC_CLK clock source                  */
    PLL0_PHI0_CLK                  = 2u,      /*!< PLL0_PHI0_CLK clock source             */
    PLL0_PHI1_CLK                  = 3u,      /*!< PLL0_PHI1_CLK clock source             */
    PLL1_PHI0_CLK                  = 4u,      /*!< PLL1_PHI0_CLK clock source             */
    END_OF_CLK_SOURCES             = 20u,      /*!< End of clock sources                  */
    /* System and common clocks */
    SCS_CLK                        = 21u,      /*!< SCS_CLK common clock                  */
    PBRIDGEx_CLK                   = 22u,      /*!< PBRIDGEx_CLK common clock             */
    HALFSYS_CLK                    = 23u,      /*!< HALFSYS_CLK common clock              */
    MOTC_CLK                       = 24u,      /*!< MOTC_CLK common clock                 */
    CORE_CLK                       = 25u,      /*!< CORE_CLK                              */
    END_OF_SYSTEM_CLKS             = 40u,      /*!< End of common and system clocks       */
    CRC0_CLK                       = 41u,      /*!< CRC0_CLK clock source                 */
    DMAMUX0_CLK                    = 42u,      /*!< DMAMUX0_CLK clock source              */
    DMAMUX1_CLK                    = 43u,      /*!< DMAMUX1_CLK clock source              */
    MEMU0_CLK                      = 44u,      /*!< MEMU0_CLK clock source                */
    PITRTI0_CLK                    = 45u,      /*!< PITRTI0_CLK clock source              */
    SPI0_CLK                       = 46u,      /*!< SPI0_CLK clock source                 */
    SPI1_CLK                       = 47u,      /*!< SPI1_CLK clock source                 */
    SPI2_CLK                       = 48u,      /*!< SPI2_CLK clock source                 */
    SPI3_CLK                       = 49u,      /*!< SPI3_CLK clock source                 */
    WKPU0_CLK                      = 50u,      /*!< WKPU0_CLK clock source                */
    END_OF_PBRIDGEx_CLKS           = 51u,      /*!< End of PBRIDGEx_CLK clocks            */
    DMA0_CLK                       = 52u,      /*!< DMA0_CLK clock source                 */
    LIN0_CLK                       = 53u,      /*!< LIN0_CLK clock source                 */
    LIN1_CLK                       = 54u,      /*!< LIN1_CLK clock source                 */
    SIPI0_CLK                      = 55u,      /*!< SIPI0_CLK clock source                */
    END_OF_HALFSYS_CLKS            = 56u,      /*!< End of HALFSYS_CLK clocks             */
    CTU0_CLK                       = 57u,      /*!< CTU0_CLK clock source                 */
    CTU1_CLK                       = 58u,      /*!< CTU1_CLK clock source                 */
    ETIMER0_CLK                    = 59u,      /*!< ETIMER0_CLK clock source              */
    ETIMER1_CLK                    = 60u,      /*!< ETIMER1_CLK clock source              */
    ETIMER2_CLK                    = 61u,      /*!< ETIMER2_CLK clock source              */
    FLEXPWM0_CLK                   = 62u,      /*!< FLEXPWM0_CLK clock source             */
    FLEXPWM1_CLK                   = 63u,      /*!< FLEXPWM1_CLK clock source             */
    END_OF_MOTC_CLKS               = 64u,      /*!< End of MOTC_CLK clocks                */
    ADC0_CLK                       = 65u,      /*!< ADC0_CLK clock source                 */
    ADC1_CLK                       = 66u,      /*!< ADC1_CLK clock source                 */
    ADC2_CLK                       = 67u,      /*!< ADC2_CLK clock source                 */
    ADC3_CLK                       = 68u,      /*!< ADC3_CLK clock source                 */
    END_OF_ADC_CLKS                = 69u,      /*!< End of ADC_CLK clocks                 */
    ENET0_CLK                      = 70u,      /*!< ENET0_CLK clock source                */
    END_OF_ENET_CLKS               = 71u,      /*!< End of ENET_CLK clocks                */
    ENET0_TIME_CLK                 = 72u,      /*!< ENET0_TIME_CLK clock source           */
    END_OF_ENET_TIME_CLKS          = 73u,      /*!< End of ENET_TIME_CLK clocks           */
    FLEXCAN0_CLK                   = 74u,      /*!< FLEXCAN0_CLK clock source             */
    FLEXCAN1_CLK                   = 75u,      /*!< FLEXCAN1_CLK clock source             */
    FLEXCAN2_CLK                   = 76u,      /*!< FLEXCAN2_CLK clock source             */
    END_OF_FLEXCAN_CLKS            = 77u,      /*!< End of FLEXCAN_CLK clocks             */
    FLEXRAY0_CLK                   = 78u,      /*!< FLEXRAY0_CLK clock source             */
    END_OF_FLEXRAY_CLKS            = 79u,      /*!< End of FLEXRAY_CLK clocks             */
    LFAST0_CLK                     = 80u,      /*!< LFAST0_CLK clock source               */
    END_OF_LFAST_CLKS              = 81u,      /*!< End of LFAST_CLK clocks               */
    SENT0_CLK                      = 82u,      /*!< SENT0_CLK clock source                */
    SENT1_CLK                      = 83u,      /*!< SENT1_CLK clock source                */
    END_OF_SENT_CLKS               = 84u,      /*!< End of SENT_CLK clocks                */
    SGEN0_CLK                      = 85u,      /*!< SGEN0_CLK clock source                */
    END_OF_SGEN_CLKS               = 86u,      /*!< End of SGEN_CLK clocks                */
    SIUL0_CLK                      = 87u,      /*!< SIUL0_CLK clock source                */
    END_OF_PERIPHERAL_CLKS         = 88u,      /*!< End of peripheral clocks              */
    CLOCK_NAME_COUNT,
} clock_names_t;

#define MC_ME_INVALID_INDEX  MC_ME_PCTLn_COUNT

  /*! @brief MC_ME clock name mappings
   *  Mappings between clock names and peripheral clock control indexes.
   *  If there is no peripheral clock control index for a clock name,
   *  then the corresponding value is MC_ME_INVALID_INDEX.
   */
#define MC_ME_CLOCK_NAME_MAPPINGS \
{                                                                              \
MC_ME_INVALID_INDEX,                /*!< IRCOSC clock                                       0  */ \
MC_ME_INVALID_INDEX,                /*!< XOSC clock                                         1  */ \
MC_ME_INVALID_INDEX,                /*!< PLL0_PHI0 clock                                    2  */ \
MC_ME_INVALID_INDEX,                /*!< PLL0_PHI1 clock                                    3  */ \
MC_ME_INVALID_INDEX,                /*!< PLL1_PHI0 clock                                    4  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    5  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    6  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    7  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    8  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    9  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    10  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    11  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    12  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    13  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    14  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    15  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    16  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    17  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    18  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    19  */ \
MC_ME_INVALID_INDEX,                /*!< END_OF_CLK_SOURCES                                 20  */  \
MC_ME_INVALID_INDEX,                /*!< SCS_CLK clock                                      21  */ \
MC_ME_INVALID_INDEX,                /*!< PBRIDGEx_CLK clock                                 22  */ \
MC_ME_INVALID_INDEX,                /*!< HALFSYS_CLK clock                                  23  */ \
MC_ME_INVALID_INDEX,                /*!< MOTC_CLK clock                                     24  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    25  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    26  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    27  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    28  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    29  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    30  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    31  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    32  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    33  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    34  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    35  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    36  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    37  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    38  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    39  */ \
MC_ME_INVALID_INDEX,                /*!< END_OF_SYSTEM_CLOCKS                               40  */  \
MC_ME_PCTL_CRC_0_INDEX,             /*!< CRC0 clock source                                  41 */ \
MC_ME_PCTL_DMAMUX_0_INDEX,          /*!< DMAMUX0 clock source                               42 */ \
MC_ME_PCTL_DMAMUX_1_INDEX,          /*!< DMAMUX1 clock source                               43 */ \
MC_ME_INVALID_INDEX,                /*!< MEMU0 clock source                                 44 */ \
MC_ME_PCTL_PIT_0_INDEX,             /*!< PITRTI0 clock source                               45 */ \
MC_ME_PCTL_DSPI_0_INDEX,            /*!< SPI0 clock source                                  46 */ \
MC_ME_PCTL_DSPI_1_INDEX,            /*!< SPI1 clock source                                  47 */ \
MC_ME_PCTL_DSPI_2_INDEX,            /*!< SPI2 clock source                                  48 */ \
MC_ME_PCTL_DSPI_3_INDEX,            /*!< SPI3 clock source                                  49 */ \
MC_ME_INVALID_INDEX,                /*!< WKPU0 clock source                                 50 */ \
MC_ME_INVALID_INDEX,                /*!< End of PBRIDGEx clocks                             51 */ \
MC_ME_INVALID_INDEX,                /*!< DMA0 clock source                                  52 */ \
MC_ME_PCTL_LINFlex_0_INDEX,         /*!< LIN0 clock source                                  53 */ \
MC_ME_PCTL_LINFlex_1_INDEX,         /*!< LIN1 clock source                                  54 */ \
MC_ME_PCTL_SIPI_0_INDEX,            /*!< SIPI0 clock source                                 55 */ \
MC_ME_INVALID_INDEX,                /*!< End of HALFSYS clocks                              56 */ \
MC_ME_PCTL_CTU_0_INDEX,             /*!< CTU0 clock source                                  57 */ \
MC_ME_PCTL_CTU_1_INDEX,             /*!< CTU1 clock source                                  58 */ \
MC_ME_PCTL_ETIMER_0_INDEX,          /*!< ETIMER0 clock source                               59 */ \
MC_ME_PCTL_ETIMER_1_INDEX,          /*!< ETIMER1 clock source                               60 */ \
MC_ME_PCTL_ETIMER_2_INDEX,          /*!< ETIMER2 clock source                               61 */ \
MC_ME_PCTL_PWM_0_INDEX,             /*!< FLEXPWM0 clock source                              62 */ \
MC_ME_PCTL_PWM_1_INDEX,             /*!< FLEXPWM1 clock source                              63 */ \
MC_ME_INVALID_INDEX,                /*!< End of MOTC clocks                                 64 */ \
MC_ME_PCTL_ADC_0_INDEX,             /*!< ADC0 clock source                                  65 */ \
MC_ME_PCTL_ADC_1_INDEX,             /*!< ADC1 clock source                                  66 */ \
MC_ME_PCTL_ADC_2_INDEX,             /*!< ADC2 clock source                                  67 */ \
MC_ME_PCTL_ADC_3_INDEX,             /*!< ADC3 clock source                                  68 */ \
MC_ME_INVALID_INDEX,                /*!< End of ADC clocks                                  69 */ \
MC_ME_PCTL_ENET_0_INDEX,            /*!< ENET0 clock source                                 70 */ \
MC_ME_INVALID_INDEX,                /*!< End of ENET clocks                                 71 */ \
MC_ME_INVALID_INDEX,                /*!< ENET0_TIME clock source                            72 */ \
MC_ME_INVALID_INDEX,                /*!< End of ENET_TIME clocks                            73 */ \
MC_ME_PCTL_CAN_0_INDEX,             /*!< FLEXCAN0 clock source                              74 */ \
MC_ME_PCTL_CAN_1_INDEX,             /*!< FLEXCAN1 clock source                              75 */ \
MC_ME_PCTL_CAN_2_INDEX,             /*!< FLEXCAN2 clock source                              76 */ \
MC_ME_INVALID_INDEX,                /*!< End of FLEXCAN clocks                              77 */ \
MC_ME_PCTL_FLEXRAY_INDEX,           /*!< FLEXRAY0 clock source                              78 */ \
MC_ME_INVALID_INDEX,                /*!< End of FLEXRAY clocks                              79 */ \
MC_ME_PCTL_LFAST_0_INDEX,           /*!< LFAST0 clock source                                80 */ \
MC_ME_INVALID_INDEX,                /*!< End of LFAST clocks                                81 */ \
MC_ME_PCTL_SENT_0_INDEX,            /*!< SENT0 clock source                                 82 */ \
MC_ME_PCTL_SENT_1_INDEX,            /*!< SENT1 clock source                                 83 */ \
MC_ME_INVALID_INDEX,                /*!< End of SENT clocks                                 84 */ \
MC_ME_PCTL_SGEN_0_INDEX,            /*!< SGEN0 clock source                                 85 */ \
MC_ME_INVALID_INDEX,                /*!< End of SGEN clocks                                 86 */ \
MC_ME_INVALID_INDEX,                /*!< SIUL0 clock source                                 87 */ \
MC_ME_INVALID_INDEX                /*!< END_OF_PERIPHERAL_CLK_SOURCES                       88 */ \
}


