beatfan/MPC5744P_Bootloader_DownMachine/MPC5744P_CAN_UserApp/src/Drivers/System/MPC5744P_features.h
  /*! @brief interface clocks
   *  Mappings between clock names and interface clocks.
   *  If no interface clock exists for a given clock name,
   *  then the corresponding value is CLOCK_NAME_COUNT.
   */
#define INTERFACE_CLOCKS \
{                                                                           \
CLOCK_NAME_COUNT,                /*!< IRCOSC clock                    0  */ \
CLOCK_NAME_COUNT,                /*!< XOSC clock                      1  */ \
CLOCK_NAME_COUNT,                /*!< PLL0_PHI0 clock                 2  */ \
CLOCK_NAME_COUNT,                /*!< PLL0_PHI1 clock                 3  */ \
CLOCK_NAME_COUNT,                /*!< PLL1_PHI0 clock                 4  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 5  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 6  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 7  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 8  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 9  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 10  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 11  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 12  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 13  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 14  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 15  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 16  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 17  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 18  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 19  */ \
CLOCK_NAME_COUNT,                /*!< END_OF_CLK_SOURCES              20  */ \
CLOCK_NAME_COUNT,                /*!< SCS_CLK clock                   21  */ \
CLOCK_NAME_COUNT,                /*!< PBRIDGEx_CLK clock              22  */ \
CLOCK_NAME_COUNT,                /*!< HALFSYS_CLK clock               23  */ \
CLOCK_NAME_COUNT,                /*!< MOTC_CLK clock                  24  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 25  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 26  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 27  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 28  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 29  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 30  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 31  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 32  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 33  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 34  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 35  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 36  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 37  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 38  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 39  */ \
CLOCK_NAME_COUNT,                /*!< END_OF_SYSTEM_CLOCKS            40  */ \
PBRIDGEx_CLK,                    /*!< CRC0 clock                      41 */ \
PBRIDGEx_CLK,                    /*!< DMAMUX0 clock                   42 */ \
PBRIDGEx_CLK,                    /*!< DMAMUX1 clock                   43 */ \
PBRIDGEx_CLK,                    /*!< MEMU0 clock                     44 */ \
PBRIDGEx_CLK,                    /*!< PITRTI0 clock                   45 */ \
PBRIDGEx_CLK,                    /*!< SPI0 clock                      46 */ \
PBRIDGEx_CLK,                    /*!< SPI1 clock                      47 */ \
PBRIDGEx_CLK,                    /*!< SPI2 clock                      48 */ \
PBRIDGEx_CLK,                    /*!< SPI3 clock                      49 */ \
PBRIDGEx_CLK,                    /*!< WKPU0 clock                     50 */ \
CLOCK_NAME_COUNT,                /*!< End of PBRIDGEx clocks          51 */ \
HALFSYS_CLK,                     /*!< DMA0 clock                      52 */ \
PBRIDGEx_CLK,                    /*!< LIN0 clock                      53 */ \
PBRIDGEx_CLK,                    /*!< LIN1 clock                      54 */ \
PBRIDGEx_CLK,                    /*!< SIPI0 clock                     55 */ \
CLOCK_NAME_COUNT,                /*!< End of HALFSYS clocks           56 */ \
PBRIDGEx_CLK,                    /*!< CTU0 clock                      57 */ \
PBRIDGEx_CLK,                    /*!< CTU1 clock                      58 */ \
MOTC_CLK,                        /*!< ETIMER0 clock                   59 */ \
MOTC_CLK,                        /*!< ETIMER1 clock                   60 */ \
MOTC_CLK,                        /*!< ETIMER2 clock                   61 */ \
PBRIDGEx_CLK,                    /*!< FLEXPWM0 clock                  62 */ \
PBRIDGEx_CLK,                    /*!< FLEXPWM1 clock                  63 */ \
CLOCK_NAME_COUNT,                /*!< End of MOTC clocks              64 */ \
PBRIDGEx_CLK,                    /*!< ADC0 clock                      65 */ \
PBRIDGEx_CLK,                    /*!< ADC1 clock                      66 */ \
PBRIDGEx_CLK,                    /*!< ADC2 clock                      67 */ \
PBRIDGEx_CLK,                    /*!< ADC3 clock                      68 */ \
CLOCK_NAME_COUNT,                /*!< End of ADC clocks               69 */ \
PBRIDGEx_CLK,                    /*!< ENET0 clock                     70 */ \
CLOCK_NAME_COUNT,                /*!< End of ENET clocks              71 */ \
PBRIDGEx_CLK,                    /*!< ENET0_TIME clock                72 */ \
CLOCK_NAME_COUNT,                /*!< End of ENET_TIME clocks         73 */ \
PBRIDGEx_CLK,                    /*!< FLEXCAN0 clock                  74 */ \
PBRIDGEx_CLK,                    /*!< FLEXCAN1 clock                  75 */ \
PBRIDGEx_CLK,                    /*!< FLEXCAN2 clock                  76 */ \
CLOCK_NAME_COUNT,                /*!< End of FLEXCAN clocks           77 */ \
PBRIDGEx_CLK,                    /*!< FLEXRAY0 clock                  78 */ \
CLOCK_NAME_COUNT,                /*!< End of FLEXRAY clocks           79 */ \
PBRIDGEx_CLK,                    /*!< LFAST0 clock                    80 */ \
CLOCK_NAME_COUNT,                /*!< End of LFAST clocks             81 */ \
PBRIDGEx_CLK,                    /*!< SENT0 clock                     82 */ \
PBRIDGEx_CLK,                    /*!< SENT1 clock                     83 */ \
CLOCK_NAME_COUNT,                /*!< End of SENT clocks              84 */ \
PBRIDGEx_CLK,                    /*!< SGEN0 clock                     85 */ \
CLOCK_NAME_COUNT,                /*!< End of SGEN clocks              86 */ \
PBRIDGEx_CLK,                    /*!< SIUL0 clock                     87 */ \
CLOCK_NAME_COUNT                /*!< END_OF_PERIPHERAL_CLK_SOURCES    88 */ \
}


/* Interrupt module features */

/* @brief Lowest interrupt request number. */
#define FEATURE_INTERRUPT_IRQ_MIN         (SS0_IRQn)
/* @brief Highest interrupt request number. */
#define FEATURE_INTERRUPT_IRQ_MAX         (SGEN_Err_IRQn)
/* @brief Highest interrupt priority number. */
#define FEATURE_INTERRUPT_PRIO_MAX  (31u)
/* @brief Highest software interrupt request number. */
#define FEATURE_INTERRUPT_SOFTWARE_IRQ_MAX  (SS15_IRQn)
/* @brief Has software interrupt. */
#define FEATURE_INTERRUPT_HAS_SOFTWARE_IRQ  (1u)
/* @brief Has pending interrupt state. */
#define FEATURE_INTERRUPT_HAS_PENDING_STATE (0u)
/* @brief Has active interrupt state. */
#define FEATURE_INTERRUPT_HAS_ACTIVE_STATE  (0u)
/* @brief Default interrupt priority for enable interrupts. */
#define FEATURE_INTERRUPT_DEFAULT_PRIO  (15u)
/* @brief Multicore support for interrupts */
#define FEATURE_INTERRUPT_MULTICORE_SUPPORT  (1u)
/* @brief Mask to enable interrupts for all cores */
#define FEATURE_INTERRUPT_ENABLE_ON_ALL_CORES_MASK  (0x8000u)
/* @brief Available cores for this device */
#define FEATURE_INTERRUPT_CORE_0_ENABLED (1u)
#define FEATURE_INTERRUPT_CORE_1_ENABLED (0u)
#define FEATURE_INTERRUPT_CORE_2_ENABLED (0u)
/* @brief Registers in which the start of interrupt vector table needs to be configured */
#define FEATURE_INTERRUPT_INT_VECTORS {&INTC->IACKR0}

