beatfan/MPC5744P_Bootloader_DownMachine/MPC5744P_CAN_UserApp/src/Drivers/System/MPC5744P_features.h
/*  @brief The block endurance for erasing successful */
#define BLOCK_MAX_ENDURANCE       (250000U)
/*  @brief The EEC error will occur in IVOR exception handler */
#define EEE_ERR_IVOR_EXCEPTION    (0)
/*  @brief The EEC error will set an ECC error in MCR register */
#define EEE_ERR_C55_MCR           (1)
/*  @brief Has 4 bytes ECC */
#define EEE_ECC4                  (0)
/*  @brief Has 8 bytes ECC */
#define EEE_ECC8                  (1)
/*  @brief Has 16 bytes ECC */
#define EEE_ECC16                 (0)
/*  @brief Has 32 bytes ECC */
#define EEE_ECC32                 (0)
/* OSIF module features */

#define FEATURE_OSIF_USE_SYSTICK                         (0)
#define FEATURE_OSIF_USE_PIT                             (1)
#define FEATURE_OSIF_FREERTOS_ISR_CONTEXT_METHOD         (2) /* PowerPC FreeRTOS v9.0.0 */
#define OSIF_PIT (PIT_0)
#define OSIF_PIT_CHAN_ID (3u)

/* FCCU module features */

#define FEATURE_FCCU_UNLOCK_OP1                (0x913756AFU)
#define FEATURE_FCCU_UNLOCK_OP2                (0x825A132BU)
#define FEATURE_FCCU_UNLOCK_OP31               (0x29AF8752U)

#define FEATURE_FCCU_NCF_KEY                   (0xAB3498FEU)

#define FEATURE_FCCU_IRQ_EN_MASK               (0x1U)

#define FEATURE_FCCU_TRANS_UNLOCK              (0xBCU)
#define FEATURE_FCCU_PERMNT_LOCK               (0xFFU)
#define FEATURE_FCCU_EINOUT_EOUTX_MASK         (FCCU_EINOUT_EOUT0_MASK|FCCU_EINOUT_EOUT1_MASK)

#define FEATURE_FCCU_MAX_FAULTS_NO             (uint8_t)(74U)
/* FCUU filter feature */
#define FEATURE_FCCU_FILTER_EN                 (1U)
/* FCCU open drain for the error indicating pin(s) */
#define FEATURE_FCCU_OPEN_DRAIN_EN             (0U)

/* MSCM module features */

/* @brief Has interrupt router control registers (IRSPRCn). */
#define FEATURE_MSCM_HAS_INTERRUPT_ROUTER                (0)
/* @brief Has directed CPU interrupt routerregisters (IRCPxxx). */
#define FEATURE_MSCM_HAS_CPU_INTERRUPT_ROUTER            (0)


/* LINFlexD module features */

/* @brief LINFlexD separate interrupt lines for rx/tx/error. */
#define FEATURE_LINFLEXD_RX_TX_ERR_INT_LINES
/* @brief Clock names for LINFlexD */
#define LINFLEXD_CLOCK_NAMES {LIN0_CLK, LIN1_CLK}
/* @brief Address of the least significant byte in a 32-bit register (depends on endianess) */
#define FEATURE_LINFLEXD_LSB_ADDR(reg)  ((uint32_t)(&(reg)) + 3U)
/* @brief Address of the least significant word in a 32-bit register (depends on endianess) */
#define FEATURE_LINFLEXD_LSW_ADDR(reg)  ((uint32_t)(&(reg)) + 2U)
/* @brief LINFlexD "instance-implemented filters" mapping */
#define FEATURE_LINFLEXD_INST_HAS_IFCR {true, true}
/* @brief LINFlexD DMA support */
#define FEATURE_LINFLEXD_HAS_DMA_ENABLED
/* @brief LINFlexD DMA enabled instances */
#define FEATURE_LINFLEXD_INST_HAS_DMA {true, true}
/* @brief LINFlexD timeout interrupt enable bit mask */
#define LINFlexD_LINIER_TOIE_MASK LINFlexD_LINIER_DBEIETOIE_MASK

/* EDMA module features */

/* @brief Number of DMA channels. */
#define FEATURE_DMA_CHANNELS (32U)
/* @brief Number of DMA virtual channels. */
#define FEATURE_DMA_VIRTUAL_CHANNELS (FEATURE_DMA_CHANNELS * DMA_INSTANCE_COUNT)
/* @brief Number of DMA interrupt lines. */
#define FEATURE_DMA_CHANNELS_INTERRUPT_LINES (32U)
/* @brief Number of DMA virtual interrupt lines. */
#define FEATURE_DMA_VIRTUAL_CHANNELS_INTERRUPT_LINES ((uint32_t)FEATURE_DMA_CHANNELS_INTERRUPT_LINES * (uint32_t)DMA_INSTANCE_COUNT)
/* @brief Number of DMA error interrupt lines. */
#define FEATURE_DMA_ERROR_INTERRUPT_LINES (1U)
/* @brief Number of DMA virtual error interrupt lines. */
#define FEATURE_DMA_VIRTUAL_ERROR_INTERRUPT_LINES ((uint32_t)FEATURE_DMA_ERROR_INTERRUPT_LINES * (uint32_t)DMA_INSTANCE_COUNT)
/* @brief DMA module has error interrupt. */
#define FEATURE_DMA_HAS_ERROR_IRQ
/* @brief DMA module separate interrupt lines for each channel */
#define FEATURE_DMA_SEPARATE_IRQ_LINES_PER_CHN
/* @brief Conversion from channel index to DCHPRI index. */
#define FEATURE_DMA_CHN_TO_DCHPRI_INDEX(x) (x)
/* @brief DMA channel groups count. */
#define FEATURE_DMA_CHANNEL_GROUP_COUNT (2U)
/* @brief Clock name for DMA */
#define FEATURE_DMA_CLOCK_NAMES {DMA0_CLK}
/* @brief Macros defined for compatibility with ARM platforms */
#define DMA_TCD_CITER_ELINKYES_CITER_LE_MASK   DMA_TCD_CITER_ELINKYES_CITER_MASK
#define DMA_TCD_CITER_ELINKYES_CITER_LE_SHIFT  DMA_TCD_CITER_ELINKYES_CITER_SHIFT
#define DMA_TCD_CITER_ELINKYES_CITER_LE_WIDTH  DMA_TCD_CITER_ELINKYES_CITER_WIDTH
#define DMA_TCD_CITER_ELINKYES_CITER_LE(x)     DMA_TCD_CITER_ELINKYES_CITER(x)
/* @brief DMA channel width based on number of TCDs: 2^N, N=4,5,... */
#define FEATURE_DMA_CH_WIDTH (5U)
/* @brief DMA channel to instance */
#define FEATURE_DMA_VCH_TO_INSTANCE(x) 	((x) >> (uint32_t)FEATURE_DMA_CH_WIDTH)
/* @brief DMA virtual channel to channel */
#define FEATURE_DMA_VCH_TO_CH(x)        ((x) & ((uint32_t)FEATURE_DMA_CHANNELS - 1U))
/* @brief DMA supports the following particular transfer size: */
#define FEATURE_DMA_TRANSFER_SIZE_8B
#define FEATURE_DMA_TRANSFER_SIZE_32B


/* DMAMUX module features */

/* @brief DMAMUX peripheral is available in silicon. */
#define FEATURE_DMAMUX_AVAILABLE
/* @brief Number of DMA channels. */
#define FEATURE_DMAMUX_CHANNELS (16U)
/* @brief Has the periodic trigger capability */
#define FEATURE_DMAMUX_HAS_TRIG (1)
/* @brief Conversion from request source to the actual DMAMUX channel */
#define FEATURE_DMAMUX_REQ_SRC_TO_CH(x) ((x) & DMAMUX_CHCFG_SOURCE_MASK)
/* @brief Mapping between request source and DMAMUX instance */
#define FEATURE_DMAMUX_REQ_SRC_TO_INSTANCE(x) (((uint8_t)x) >> (uint8_t)DMAMUX_CHCFG_SOURCE_WIDTH)
/* @brief Conversion from eDMA channel index to DMAMUX channel. */
#define FEATURE_DMAMUX_DMA_CH_TO_CH(x) ((x) & (FEATURE_DMAMUX_CHANNELS - 1U))
/* @brief Conversion from DMAMUX channel DMAMUX register index. */
#define FEATURE_DMAMUX_CHN_REG_INDEX(x) (x)
/* @brief Clock names for DMAMUX */
#define FEATURE_DMAMUX_CLOCK_NAMES {DMAMUX0_CLK, DMAMUX1_CLK}
/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request into DMAMUX to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum {
    EDMA_REQ_MUX_0_DISABLED = 0U,
    EDMA_REQ_DSPI_2_TFFF = 1U,
    EDMA_REQ_DSPI_2_RFDF = 2U,
    EDMA_REQ_DSPI_3_TFFF = 3U,
    EDMA_REQ_DSPI_3_RFDF = 4U,
    EDMA_REQ_CTU_0_CTU = 5U,
    EDMA_REQ_CTU_0_FIFO1 = 6U,
    EDMA_REQ_CTU_0_FIFO2 = 7U,
    EDMA_REQ_CTU_0_FIFO3 = 8U,
    EDMA_REQ_CTU_0_FIFO4 = 9U,
    EDMA_REQ_FLEXPWM_0_COMP_VAL = 10U,
    EDMA_REQ_FlexPWM_0_CAPT = 11U,
    EDMA_REQ_ETIMER_0_DREQ_0 = 12U,
    EDMA_REQ_ETIMER_0_DREQ_1 = 13U,
    EDMA_REQ_ETIMER_0_DREQ_2 = 14U,
    EDMA_REQ_ETIMER_0_DREQ_3 = 15U,
    EDMA_REQ_ETIMER_2_DREQ_0 = 16U,
    EDMA_REQ_ETIMER_2_DREQ_1 = 17U,
    EDMA_REQ_ADC_0 = 18U,
    EDMA_REQ_ADC_2 = 19U,
    EDMA_REQ_LIN_0_TX = 20U,
    EDMA_REQ_LIN_0_RX = 21U,
    EDMA_REQ_SENT_1_FAST_MSG = 22U,
    EDMA_REQ_SENT_1_SLOW_MSG = 23U,
    EDMA_REQ_MUX_0_ALWAYS_ENABLED_0 = 24U,
    EDMA_REQ_MUX_0_ALWAYS_ENABLED_1 = 25U,
    EDMA_REQ_MUX_0_ALWAYS_ENABLED_2 = 26U,
    EDMA_REQ_MUX_0_ALWAYS_ENABLED_3 = 27U,
    EDMA_REQ_MUX_0_ALWAYS_ENABLED_4 = 28U,
    EDMA_REQ_MUX_0_ALWAYS_ENABLED_5 = 29U,
    EDMA_REQ_MUX_1_DISABLED = 64U,
    EDMA_REQ_DSPI_0_TFFF = 65U,
    EDMA_REQ_DSPI_0_RFDF = 66U,
    EDMA_REQ_DSPI_1_TFFF = 67U,
    EDMA_REQ_DSPI_1_RFDF = 68U,
    EDMA_REQ_CTU_1_CTU = 69U,
    EDMA_REQ_CTU_1_FIFO1 = 70U,
    EDMA_REQ_CTU_1_FIFO2 = 71U,
    EDMA_REQ_CTU_1_FIFO3 = 72U,
    EDMA_REQ_CTU_1_FIFO4 = 73U,
    EDMA_REQ_ETIMER_1_DREQ_0 = 74U,
    EDMA_REQ_ETIMER_1_DREQ_1 = 75U,
    EDMA_REQ_ADC_1 = 76U,
    EDMA_REQ_ADC_3 = 77U,
    EDMA_REQ_LIN_1_TX = 78U,
    EDMA_REQ_LIN_1_RX = 79U,
    EDMA_REQ_FLEXPWM_1_COMP_VAL = 80U,
    EDMA_REQ_FLEXPWM_1_CAPT = 81U,
    EDMA_REQ_SIPI_CH_0 = 82U,
    EDMA_REQ_SIPI_CH_1 = 83U,
    EDMA_REQ_SIPI_CH_2 = 84U,
    EDMA_REQ_SIPI_CH_3 = 85U,
    EDMA_REQ_SENT_0_FAST_MSG = 86U,
    EDMA_REQ_SENT_0_SLOW_MSG = 87U,
    EDMA_REQ_SIUL2_REQ_0 = 88U,
    EDMA_REQ_SIUL2_REQ_1 = 89U,
    EDMA_REQ_SIUL2_REQ_2 = 90U,
    EDMA_REQ_SIUL2_REQ_3 = 91U,
    EDMA_REQ_MUX_1_ALWAYS_ENABLED_0 = 92U,
    EDMA_REQ_MUX_1_ALWAYS_ENABLED_1 = 93U,
    EDMA_REQ_MUX_1_ALWAYS_ENABLED_2 = 94U,
    EDMA_REQ_MUX_1_ALWAYS_ENABLED_3 = 95U,
    EDMA_REQ_MUX_1_ALWAYS_ENABLED_4 = 96U,
    EDMA_REQ_MUX_1_ALWAYS_ENABLED_5 = 97U
} dma_request_source_t;

